Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.5.75/samv70b/edc/ATSAMV70N19B.PIC
      <edc:SFRDef edc:_addr="0x400340D0" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="MCAN1_TXBAR" edc:nzwidth="0x20" ltx:memberofperipheral="MCAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN1">
            <edc:SFRFieldDef edc:cname="AR0" edc:desc="Add Request for Transmit Buffer 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR1" edc:desc="Add Request for Transmit Buffer 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR2" edc:desc="Add Request for Transmit Buffer 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR3" edc:desc="Add Request for Transmit Buffer 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR4" edc:desc="Add Request for Transmit Buffer 4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR5" edc:desc="Add Request for Transmit Buffer 5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR6" edc:desc="Add Request for Transmit Buffer 6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR7" edc:desc="Add Request for Transmit Buffer 7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR8" edc:desc="Add Request for Transmit Buffer 8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR9" edc:desc="Add Request for Transmit Buffer 9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR10" edc:desc="Add Request for Transmit Buffer 10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR11" edc:desc="Add Request for Transmit Buffer 11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR12" edc:desc="Add Request for Transmit Buffer 12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR13" edc:desc="Add Request for Transmit Buffer 13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR14" edc:desc="Add Request for Transmit Buffer 14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR15" edc:desc="Add Request for Transmit Buffer 15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR16" edc:desc="Add Request for Transmit Buffer 16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR17" edc:desc="Add Request for Transmit Buffer 17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR18" edc:desc="Add Request for Transmit Buffer 18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR19" edc:desc="Add Request for Transmit Buffer 19" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR20" edc:desc="Add Request for Transmit Buffer 20" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR21" edc:desc="Add Request for Transmit Buffer 21" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR22" edc:desc="Add Request for Transmit Buffer 22" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR23" edc:desc="Add Request for Transmit Buffer 23" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR24" edc:desc="Add Request for Transmit Buffer 24" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR25" edc:desc="Add Request for Transmit Buffer 25" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR26" edc:desc="Add Request for Transmit Buffer 26" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR27" edc:desc="Add Request for Transmit Buffer 27" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR28" edc:desc="Add Request for Transmit Buffer 28" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR29" edc:desc="Add Request for Transmit Buffer 29" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR30" edc:desc="Add Request for Transmit Buffer 30" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AR31" edc:desc="Add Request for Transmit Buffer 31" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400340D4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="MCAN1_TXBCR" edc:nzwidth="0x20" ltx:memberofperipheral="MCAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN1">
            <edc:SFRFieldDef edc:cname="CR0" edc:desc="Cancellation Request for Transmit Buffer 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR1" edc:desc="Cancellation Request for Transmit Buffer 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR2" edc:desc="Cancellation Request for Transmit Buffer 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR3" edc:desc="Cancellation Request for Transmit Buffer 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR4" edc:desc="Cancellation Request for Transmit Buffer 4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR5" edc:desc="Cancellation Request for Transmit Buffer 5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR6" edc:desc="Cancellation Request for Transmit Buffer 6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR7" edc:desc="Cancellation Request for Transmit Buffer 7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR8" edc:desc="Cancellation Request for Transmit Buffer 8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR9" edc:desc="Cancellation Request for Transmit Buffer 9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR10" edc:desc="Cancellation Request for Transmit Buffer 10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR11" edc:desc="Cancellation Request for Transmit Buffer 11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR12" edc:desc="Cancellation Request for Transmit Buffer 12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR13" edc:desc="Cancellation Request for Transmit Buffer 13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR14" edc:desc="Cancellation Request for Transmit Buffer 14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR15" edc:desc="Cancellation Request for Transmit Buffer 15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR16" edc:desc="Cancellation Request for Transmit Buffer 16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR17" edc:desc="Cancellation Request for Transmit Buffer 17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR18" edc:desc="Cancellation Request for Transmit Buffer 18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR19" edc:desc="Cancellation Request for Transmit Buffer 19" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR20" edc:desc="Cancellation Request for Transmit Buffer 20" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR21" edc:desc="Cancellation Request for Transmit Buffer 21" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR22" edc:desc="Cancellation Request for Transmit Buffer 22" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR23" edc:desc="Cancellation Request for Transmit Buffer 23" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR24" edc:desc="Cancellation Request for Transmit Buffer 24" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR25" edc:desc="Cancellation Request for Transmit Buffer 25" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR26" edc:desc="Cancellation Request for Transmit Buffer 26" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR27" edc:desc="Cancellation Request for Transmit Buffer 27" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR28" edc:desc="Cancellation Request for Transmit Buffer 28" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR29" edc:desc="Cancellation Request for Transmit Buffer 29" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR30" edc:desc="Cancellation Request for Transmit Buffer 30" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CR31" edc:desc="Cancellation Request for Transmit Buffer 31" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
