Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.5.75/samv70b/edc/ATSAMV70N19B.PIC
      <edc:AdjustPoint edc:_addr="0x40038588" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x40038590" edc:access="-------------------w----wwwwwwww" edc:cname="USBHS_HSTPIPIFR0" edc:impl="0x10FF" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINIS" edc:desc="Received IN Data Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXOUTIS" edc:desc="Transmitted OUT Data Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNDERFIS" edc:desc="Underflow Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PERRIS" edc:desc="Pipe Error Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKEDIS" edc:desc="NAKed Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFIS" edc:desc="Overflow Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRCERRIS" edc:desc="CRC Error Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIS" edc:desc="Short Packet Interrupt Set" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKS" edc:desc="Number of Busy Banks Set" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038594" edc:access="-------------------w----wwwwwwww" edc:cname="USBHS_HSTPIPIFR1" edc:impl="0x10FF" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINIS" edc:desc="Received IN Data Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXOUTIS" edc:desc="Transmitted OUT Data Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNDERFIS" edc:desc="Underflow Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PERRIS" edc:desc="Pipe Error Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKEDIS" edc:desc="NAKed Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFIS" edc:desc="Overflow Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRCERRIS" edc:desc="CRC Error Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIS" edc:desc="Short Packet Interrupt Set" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKS" edc:desc="Number of Busy Banks Set" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038598" edc:access="-------------------w----wwwwwwww" edc:cname="USBHS_HSTPIPIFR2" edc:impl="0x10FF" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINIS" edc:desc="Received IN Data Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXOUTIS" edc:desc="Transmitted OUT Data Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNDERFIS" edc:desc="Underflow Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PERRIS" edc:desc="Pipe Error Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKEDIS" edc:desc="NAKed Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFIS" edc:desc="Overflow Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRCERRIS" edc:desc="CRC Error Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIS" edc:desc="Short Packet Interrupt Set" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKS" edc:desc="Number of Busy Banks Set" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003859C" edc:access="-------------------w----wwwwwwww" edc:cname="USBHS_HSTPIPIFR3" edc:impl="0x10FF" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINIS" edc:desc="Received IN Data Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXOUTIS" edc:desc="Transmitted OUT Data Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNDERFIS" edc:desc="Underflow Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PERRIS" edc:desc="Pipe Error Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKEDIS" edc:desc="NAKed Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFIS" edc:desc="Overflow Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRCERRIS" edc:desc="CRC Error Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIS" edc:desc="Short Packet Interrupt Set" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKS" edc:desc="Number of Busy Banks Set" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400385A0" edc:access="-------------------w----wwwwwwww" edc:cname="USBHS_HSTPIPIFR4" edc:impl="0x10FF" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINIS" edc:desc="Received IN Data Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXOUTIS" edc:desc="Transmitted OUT Data Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNDERFIS" edc:desc="Underflow Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PERRIS" edc:desc="Pipe Error Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKEDIS" edc:desc="NAKed Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFIS" edc:desc="Overflow Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRCERRIS" edc:desc="CRC Error Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIS" edc:desc="Short Packet Interrupt Set" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKS" edc:desc="Number of Busy Banks Set" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400385A4" edc:access="-------------------w----wwwwwwww" edc:cname="USBHS_HSTPIPIFR5" edc:impl="0x10FF" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINIS" edc:desc="Received IN Data Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXOUTIS" edc:desc="Transmitted OUT Data Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNDERFIS" edc:desc="Underflow Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PERRIS" edc:desc="Pipe Error Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKEDIS" edc:desc="NAKed Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFIS" edc:desc="Overflow Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRCERRIS" edc:desc="CRC Error Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIS" edc:desc="Short Packet Interrupt Set" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKS" edc:desc="Number of Busy Banks Set" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400385A8" edc:access="-------------------w----wwwwwwww" edc:cname="USBHS_HSTPIPIFR6" edc:impl="0x10FF" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINIS" edc:desc="Received IN Data Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXOUTIS" edc:desc="Transmitted OUT Data Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNDERFIS" edc:desc="Underflow Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PERRIS" edc:desc="Pipe Error Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKEDIS" edc:desc="NAKed Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFIS" edc:desc="Overflow Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRCERRIS" edc:desc="CRC Error Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIS" edc:desc="Short Packet Interrupt Set" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKS" edc:desc="Number of Busy Banks Set" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400385AC" edc:access="-------------------w----wwwwwwww" edc:cname="USBHS_HSTPIPIFR7" edc:impl="0x10FF" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINIS" edc:desc="Received IN Data Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXOUTIS" edc:desc="Transmitted OUT Data Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNDERFIS" edc:desc="Underflow Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PERRIS" edc:desc="Pipe Error Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKEDIS" edc:desc="NAKed Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFIS" edc:desc="Overflow Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRCERRIS" edc:desc="CRC Error Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIS" edc:desc="Short Packet Interrupt Set" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKS" edc:desc="Number of Busy Banks Set" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
