Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.5.75/samv70b/edc/ATSAMV70N19B.PIC
      <edc:SFRDef edc:_addr="0x400780B4" edc:access="--------------------nnnnnnnnnnnn" edc:cname="XDMAC_CHID1XDMAC_CBC" edc:impl="0xFFF" edc:nzwidth="0x20" ltx:memberofperipheral="XDMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="BLEN" edc:desc="Channel x Block Length" edc:nzwidth="0xC"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400780B8" edc:access="-nnnnnnnnnn-nnnn-nnnnnnnnn-n-nnn" edc:cname="XDMAC_CHID1XDMAC_CC" edc:impl="0x7FEF7FD7" edc:nzwidth="0x20" ltx:memberofperipheral="XDMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="TYPE" edc:desc="Channel x Transfer Type" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="MEM_TRAN" edc:desc="Self-triggered mode (memory-to-memory transfer)." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PER_TRAN" edc:desc="Synchronized mode (peripheral-to-memory or memory-to-peripheral transfer)." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="MBSIZE" edc:desc="Channel x Memory Burst Size" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="SINGLE" edc:desc="The memory burst size is set to one." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="FOUR" edc:desc="The memory burst size is set to four." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="EIGHT" edc:desc="The memory burst size is set to eight." edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="SIXTEEN" edc:desc="The memory burst size is set to sixteen." edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DSYNC" edc:desc="Channel x Synchronization" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="PER2MEM" edc:desc="Peripheral-to-memory transfer." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="MEM2PER" edc:desc="Memory-to-peripheral transfer." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SWREQ" edc:desc="Channel x Software Request Trigger" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="HWR_CONNECTED" edc:desc="Hardware request line is connected to the peripheral request line." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="SWR_CONNECTED" edc:desc="Software request is connected to the peripheral request line." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="MEMSET" edc:desc="Channel x Fill Block of memory" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NORMAL_MODE" edc:desc="Memset is not activated." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HW_MODE" edc:desc="Sets the block of memory pointed by DA field to the specified value. This operation is performed on 8-, 16- or 32-bit basis." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CSIZE" edc:desc="Channel x Chunk Size" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="CHK_1" edc:desc="1 data transferred" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="CHK_2" edc:desc="2 data transferred" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="CHK_4" edc:desc="4 data transferred" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="CHK_8" edc:desc="8 data transferred" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="CHK_16" edc:desc="16 data transferred" edc:when="(field &amp; 0x7) == 0x4"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DWIDTH" edc:desc="Channel x Data Width" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="BYTE" edc:desc="The data size is set to 8 bits" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="HALFWORD" edc:desc="The data size is set to 16 bits" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="WORD" edc:desc="The data size is set to 32 bits" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SIF" edc:desc="Channel x Source Interface Identifier" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="AHB_IF0" edc:desc="The data is read through the system bus interface 0." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="AHB_IF1" edc:desc="The data is read through the system bus interface 1." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DIF" edc:desc="Channel x Destination Interface Identifier" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="AHB_IF0" edc:desc="The data is written through the system bus interface 0." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="AHB_IF1" edc:desc="The data is written though the system bus interface 1." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SAM" edc:desc="Channel x Source Addressing Mode" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="FIXED_AM" edc:desc="The address remains unchanged." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="INCREMENTED_AM" edc:desc="The addressing mode is incremented (the increment size is set to the data size)." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="UBS_AM" edc:desc="The microblock stride is added at the microblock boundary." edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="UBS_DS_AM" edc:desc="The microblock stride is added at the microblock boundary, the data stride is added at the data boundary." edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DAM" edc:desc="Channel x Destination Addressing Mode" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="FIXED_AM" edc:desc="The address remains unchanged." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="INCREMENTED_AM" edc:desc="The addressing mode is incremented (the increment size is set to the data size)." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="UBS_AM" edc:desc="The microblock stride is added at the microblock boundary." edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="UBS_DS_AM" edc:desc="The microblock stride is added at the microblock boundary; the data stride is added at the data boundary." edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="INITD" edc:desc="Channel Initialization Terminated (this bit is read-only)" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="IN_PROGRESS" edc:desc="Channel initialization is in progress." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="TERMINATED" edc:desc="Channel initialization is completed." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RDIP" edc:desc="Read in Progress (this bit is read-only)" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DONE" edc:desc="No active read transaction on the bus." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="IN_PROGRESS" edc:desc="A read transaction is in progress." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WRIP" edc:desc="Write in Progress (this bit is read-only)" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DONE" edc:desc="No active write transaction on the bus." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="IN_PROGRESS" edc:desc="A write transaction is in progress." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PERID" edc:desc="Channel x Peripheral Hardware Request Line Identifier" edc:nzwidth="0x7">
              <edc:SFRFieldSemantic edc:cname="HSMCI" edc:desc="HSMCI" edc:when="(field &amp; 0x7F) == 0"/>
              <edc:SFRFieldSemantic edc:cname="SPI0_TX" edc:desc="SPI0_TX" edc:when="(field &amp; 0x7F) == 1"/>
              <edc:SFRFieldSemantic edc:cname="SPI0_RX" edc:desc="SPI0_RX" edc:when="(field &amp; 0x7F) == 2"/>
              <edc:SFRFieldSemantic edc:cname="QSPI_TX" edc:desc="QSPI_TX" edc:when="(field &amp; 0x7F) == 5"/>
              <edc:SFRFieldSemantic edc:cname="QSPI_RX" edc:desc="QSPI_RX" edc:when="(field &amp; 0x7F) == 6"/>
              <edc:SFRFieldSemantic edc:cname="USART0_TX" edc:desc="USART0_TX" edc:when="(field &amp; 0x7F) == 7"/>
              <edc:SFRFieldSemantic edc:cname="USART0_RX" edc:desc="USART0_RX" edc:when="(field &amp; 0x7F) == 8"/>
              <edc:SFRFieldSemantic edc:cname="USART1_TX" edc:desc="USART1_TX" edc:when="(field &amp; 0x7F) == 9"/>
              <edc:SFRFieldSemantic edc:cname="USART1_RX" edc:desc="USART1_RX" edc:when="(field &amp; 0x7F) == 10"/>
              <edc:SFRFieldSemantic edc:cname="USART2_TX" edc:desc="USART2_TX" edc:when="(field &amp; 0x7F) == 11"/>
              <edc:SFRFieldSemantic edc:cname="USART2_RX" edc:desc="USART2_RX" edc:when="(field &amp; 0x7F) == 12"/>
              <edc:SFRFieldSemantic edc:cname="PWM0" edc:desc="PWM0" edc:when="(field &amp; 0x7F) == 13"/>
              <edc:SFRFieldSemantic edc:cname="TWIHS0_TX" edc:desc="TWIHS0_TX" edc:when="(field &amp; 0x7F) == 14"/>
              <edc:SFRFieldSemantic edc:cname="TWIHS0_RX" edc:desc="TWIHS0_RX" edc:when="(field &amp; 0x7F) == 15"/>
              <edc:SFRFieldSemantic edc:cname="TWIHS1_TX" edc:desc="TWIHS1_TX" edc:when="(field &amp; 0x7F) == 16"/>
              <edc:SFRFieldSemantic edc:cname="TWIHS1_RX" edc:desc="TWIHS1_RX" edc:when="(field &amp; 0x7F) == 17"/>
              <edc:SFRFieldSemantic edc:cname="TWIHS2_TX" edc:desc="TWIHS2_TX" edc:when="(field &amp; 0x7F) == 18"/>
              <edc:SFRFieldSemantic edc:cname="TWIHS2_RX" edc:desc="TWIHS2_RX" edc:when="(field &amp; 0x7F) == 19"/>
              <edc:SFRFieldSemantic edc:cname="UART0_TX" edc:desc="UART0_TX" edc:when="(field &amp; 0x7F) == 20"/>
              <edc:SFRFieldSemantic edc:cname="UART0_RX" edc:desc="UART0_RX" edc:when="(field &amp; 0x7F) == 21"/>
              <edc:SFRFieldSemantic edc:cname="UART1_TX" edc:desc="UART1_TX" edc:when="(field &amp; 0x7F) == 22"/>
              <edc:SFRFieldSemantic edc:cname="UART1_RX" edc:desc="UART1_RX" edc:when="(field &amp; 0x7F) == 23"/>
              <edc:SFRFieldSemantic edc:cname="UART2_TX" edc:desc="UART2_TX" edc:when="(field &amp; 0x7F) == 24"/>
              <edc:SFRFieldSemantic edc:cname="UART2_RX" edc:desc="UART2_RX" edc:when="(field &amp; 0x7F) == 25"/>
              <edc:SFRFieldSemantic edc:cname="UART3_TX" edc:desc="UART3_TX" edc:when="(field &amp; 0x7F) == 26"/>
              <edc:SFRFieldSemantic edc:cname="UART3_RX" edc:desc="UART3_RX" edc:when="(field &amp; 0x7F) == 27"/>
              <edc:SFRFieldSemantic edc:cname="UART4_TX" edc:desc="UART4_TX" edc:when="(field &amp; 0x7F) == 28"/>
              <edc:SFRFieldSemantic edc:cname="UART4_RX" edc:desc="UART4_RX" edc:when="(field &amp; 0x7F) == 29"/>
              <edc:SFRFieldSemantic edc:cname="DACC0" edc:desc="DACC0" edc:when="(field &amp; 0x7F) == 30"/>
              <edc:SFRFieldSemantic edc:cname="DACC1" edc:desc="DACC1" edc:when="(field &amp; 0x7F) == 31"/>
              <edc:SFRFieldSemantic edc:cname="SSC_TX" edc:desc="SSC_TX" edc:when="(field &amp; 0x7F) == 32"/>
              <edc:SFRFieldSemantic edc:cname="SSC_RX" edc:desc="SSC_RX" edc:when="(field &amp; 0x7F) == 33"/>
              <edc:SFRFieldSemantic edc:cname="PIOA" edc:desc="PIOA" edc:when="(field &amp; 0x7F) == 34"/>
              <edc:SFRFieldSemantic edc:cname="AFEC0" edc:desc="AFEC0" edc:when="(field &amp; 0x7F) == 35"/>
              <edc:SFRFieldSemantic edc:cname="AFEC1" edc:desc="AFEC1" edc:when="(field &amp; 0x7F) == 36"/>
              <edc:SFRFieldSemantic edc:cname="AES_TX" edc:desc="AES_TX" edc:when="(field &amp; 0x7F) == 37"/>
              <edc:SFRFieldSemantic edc:cname="AES_RX" edc:desc="AES_RX" edc:when="(field &amp; 0x7F) == 38"/>
              <edc:SFRFieldSemantic edc:cname="PWM1" edc:desc="PWM1" edc:when="(field &amp; 0x7F) == 39"/>
              <edc:SFRFieldSemantic edc:cname="TC0" edc:desc="TC0" edc:when="(field &amp; 0x7F) == 40"/>
              <edc:SFRFieldSemantic edc:cname="TC3" edc:desc="TC3" edc:when="(field &amp; 0x7F) == 41"/>
              <edc:SFRFieldSemantic edc:cname="TC6" edc:desc="TC6" edc:when="(field &amp; 0x7F) == 42"/>
              <edc:SFRFieldSemantic edc:cname="TC9" edc:desc="TC9" edc:when="(field &amp; 0x7F) == 43"/>
              <edc:SFRFieldSemantic edc:cname="I2SC0_TX_LEFT" edc:desc="I2SC0_TX_LEFT" edc:when="(field &amp; 0x7F) == 44"/>
              <edc:SFRFieldSemantic edc:cname="I2SC0_RX_LEFT" edc:desc="I2SC0_RX_LEFT" edc:when="(field &amp; 0x7F) == 45"/>
              <edc:SFRFieldSemantic edc:cname="I2SC0_TX_RIGHT" edc:desc="I2SC0_TX_RIGHT" edc:when="(field &amp; 0x7F) == 48"/>
              <edc:SFRFieldSemantic edc:cname="I2SC0_RX_RIGHT" edc:desc="I2SC0_RX_RIGHT" edc:when="(field &amp; 0x7F) == 49"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400780BC" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="XDMAC_CHID1XDMAC_CDS_MSP" edc:nzwidth="0x20" ltx:memberofperipheral="XDMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="SDS_MSP" edc:desc="Channel x Source Data stride or Memory Set Pattern" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="DDS_MSP" edc:desc="Channel x Destination Data Stride or Memory Set Pattern" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400780C0" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="XDMAC_CHID1XDMAC_CSUS" edc:impl="0xFFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="XDMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="SUBS" edc:desc="Channel x Source Microblock Stride" edc:nzwidth="0x18"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400780C4" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="XDMAC_CHID1XDMAC_CDUS" edc:impl="0xFFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="XDMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="DUBS" edc:desc="Channel x Destination Microblock Stride" edc:nzwidth="0x18"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400780C8" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x400780D0" edc:access="-------------------------wwwwwww" edc:cname="XDMAC_CHID2XDMAC_CIE" edc:impl="0x7F" edc:nzwidth="0x20" ltx:memberofperipheral="XDMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="BIE" edc:desc="End of Block Interrupt Enable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LIE" edc:desc="End of Linked List Interrupt Enable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIE" edc:desc="End of Disable Interrupt Enable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIE" edc:desc="End of Flush Interrupt Enable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RBIE" edc:desc="Read Bus Error Interrupt Enable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WBIE" edc:desc="Write Bus Error Interrupt Enable Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ROIE" edc:desc="Request Overflow Error Interrupt Enable Bit" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
